wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_spi_master_jdi_def.h
/**
*********************************************************************************************************
*               Copyright(c) 2024, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* @file      rtl876x_spi_master_jdi_def.h
* @brief     SPI Master JDI Structures Section
* @details
* @author    qinyuan_hu
* @date      2024-06-13
* @version   v1.0
* *********************************************************************************************************
*/

#ifndef RTL876X_SPI_Master_JDI_DEF_H
#define RTL876X_SPI_Master_JDI_DEF_H

#include "rtl876x.h"

#ifdef  __cplusplus
extern "C" {
#endif /* __cplusplus */

/*============================================================================*
 *                          SPI Defines
 *============================================================================*/
#define SPI1_TX_FIFO_SIZE                               (32)
#define SPI1_RX_FIFO_SIZE                               (32)
#define SPI1_SUPPORT_WRAP_MODE                          (1)
#define SPI1_SUPPORT_HS                                 (1)
#define SPI1_SUPPORT_APH_BRIDGE_FOR_HIGH_SPEED          (1)
#define SPI1_SUPPORT_JDI                                (1)
//#define SPI1_SUPPORT_CLOCK_SOURCE_SWITCH                (1)

/*============================================================================*
 *                          SPI_Master_JDI Registers Memory Map
 *============================================================================*/
typedef struct
{
    __IO uint32_t SPI_CTRL0;                        /*!< 0x00 */
    __IO uint32_t SPI_CTRL1;                        /*!< 0x04 */
    __IO uint32_t SPI_ENR;                          /*!< 0x08 */
    __IO uint32_t RSVD_0C;                          /*!< 0x0C */
    __IO uint32_t SPI_SER;                          /*!< 0x10 */
    __IO uint32_t SPI_BAUDR;                        /*!< 0x14 */
    __IO uint32_t SPI_TXFTLR;                       /*!< 0x18 */
    __IO uint32_t SPI_RXFTLR;                       /*!< 0x1C */
    __IO uint32_t SPI_TXFLR;                        /*!< 0x20 */
    __IO uint32_t SPI_RXFLR;                        /*!< 0x24 */
    __IO uint32_t SPI_SR;                           /*!< 0x28 */
    __IO uint32_t SPI_IMR;                          /*!< 0x2C */
    __IO uint32_t SPI_ISR;                          /*!< 0x30 */
    __IO uint32_t SPI_RISR;                         /*!< 0x34 */
    __IO uint32_t SPI_TXOICR;                       /*!< 0x38 */
    __IO uint32_t SPI_RXOICR;                       /*!< 0x3C */
    __IO uint32_t SPI_RXUICR;                       /*!< 0x40 */
    __IO uint32_t RSVD_044;                         /*!< 0x44 */
    __IO uint32_t SPI_ICR;                          /*!< 0x48 */
    __IO uint32_t SPI_DMACR;                        /*!< 0x4C */
    __IO uint32_t SPI_DMATDLR;                      /*!< 0x50 */
    __IO uint32_t SPI_DMARDLR;                      /*!< 0x54 */
    __IO uint32_t RSVD_058[2];                      /*!< 0x58 */
    __IO uint32_t SPI_DR[1];                        /*!< 0x60 */
    __IO uint32_t RSVD_064[35];                     /*!< 0x64 */
    __IO uint32_t SPI_RSDR;                         /*!< 0xF0 */
    __IO uint32_t RSVD_0F4[67];                     /*!< 0xF4 */
    __IO uint32_t SPI_WRAP_CTRL;                    /*!< 0x200 */
    __IO uint32_t SPI_WRAP_TXFTLR;                  /*!< 0x204 */
    __IO uint32_t SPI_MST_TXFLR;                    /*!< 0x208 */
    __IO uint32_t SPI_WRAP_SR;                      /*!< 0x20C */
    __IO uint32_t SPI_WRAP_IMR;                     /*!< 0x210 */
    __IO uint32_t SPI_WRAP_ISR;                     /*!< 0x214 */
    __IO uint32_t SPI_WRAP_RISR;                    /*!< 0x218 */
    __IO uint32_t SPI_WRAP_ICR;                     /*!< 0x21C */
    __IO uint32_t SPI_WRAP_DMACR;                   /*!< 0x220 */
    __IO uint32_t SPI_WRAP_DMATDLR;                 /*!< 0x224 */
    __IO uint32_t SPI_WRAP_TXNDF_CNT;               /*!< 0x228 */
    __IO uint32_t SPI_WRAP_CS_DLY;                  /*!< 0x22C */
    __IO uint32_t RSVD_0230[116];                   /*!< 0x230 */
    __IO uint32_t CTL0;                             /*!< 0x400 */
    __IO uint32_t CTL1;                             /*!< 0x404 */
    __IO uint32_t MODE_SEL;                         /*!< 0x408 */
    __IO uint32_t DATA_TRANSFER_DUMMY;              /*!< 0x40C */
    __IO uint32_t DATA_WRITTEN_HORIZONTAL;          /*!< 0x410 */
    __IO uint32_t DATA_WRITTEN_VERTICAL;            /*!< 0x414 */
    __IO uint32_t OUTPUT_COUNTER;                   /*!< 0x418 */
    __IO uint32_t OUTPUT_LINE_COUNTER;              /*!< 0x41C */
    __IO uint32_t RX_FIFO;                          /*!< 0x420 */
    __IO uint32_t TX_FIFO;                          /*!< 0x424 */
    __IO uint32_t RX_FIFO_OFFSET;                   /*!< 0x428 */
    __IO uint32_t TX_FIFO_OFFSET;                   /*!< 0x42C */
    __IO uint32_t RX_FIFO_DMA_THRESHOLD;            /*!< 0x430 */
    __IO uint32_t TX_FIFO_DMA_THRESHOLD;            /*!< 0x434 */
    __IO uint32_t RX_FIFO_INT_THRESHOLD;            /*!< 0x438 */
    __IO uint32_t TX_FIFO_INT_THRESHOLD;            /*!< 0x43C */
    __IO uint32_t INT_ENABLE;                       /*!< 0x440 */
    __IO uint32_t INT_MASK;                         /*!< 0x444 */
    __IO uint32_t INT_RAW_STATUS;                   /*!< 0x448 */
    __IO uint32_t INT_STATUS;                       /*!< 0x44C */
    __IO uint32_t INT_CLEAR;                        /*!< 0x450 */
} SPI_JDI_TypeDef;

/*============================================================================*
 *                          SPI_Master_JDI Declaration
 *============================================================================*/

/*============================================================================*
 *                          SPI_Master_JDI Registers and Field Descriptions
 *============================================================================*/
/* 0x00
   3:0     R/W    DFS                             4'h0
   5:4     R/W    FRF                             2'b0
   6       R/W    SCPH                            1'b0
   7       R/W    SCPOL                           1'b0
   9:8     R/W    TMOD                            2'b0
   11:10   R      reserved0_11_10                 2'b0
   15:12   R      reserved0_15_12                 4'b0
   20:16   R      DFS_31                          5'h0
   22:21   R      SPI_FRF                         2'b0
   23      R      reserved0_23                    1'b0
   24      R/W    SSTE                            1'b1
   31:25   R      reserved0_31_25                 7'b0
*/
typedef union
{
    uint32_t d32;
    struct
    {
        uint32_t DFS: 4;
        uint32_t FRF: 2;
        uint32_t SCPH: 1;
        uint32_t SCPOL: 1;
        uint32_t TMOD: 2;
        const uint32_t reserved_3: 2;
            const uint32_t reserved_2: 4;
            const uint32_t DFS_31: 5;
            const uint32_t SPI_FRF: 2;
            const uint32_t reserved_1: 1;
            uint32_t SSTE: 1;
            const uint32_t reserved_0: 7;
        } b;
    } SPI_JDI_CTRL0_TypeDef;


