wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_spi_master_jdi_def.h
    /* 0x04
       15:0    R/W    NDF                             16'h0
       31:16   R      reserved4_31_16                 16'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t NDF: 16;
                const uint32_t reserved_0: 16;
            } b;
        } SPI_JDI_CTRL1_TypeDef;


    /* 0x08
       0       R/W    SPI_EN                          1'b0
       31:1    R      reserved8_31_1                  31'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t SPI_EN: 1;
                const uint32_t reserved_0: 31;
            } b;
        } SPI_JDI_ENR_TypeDef;


    /* 0x10
       0       R/W    SER                             1'b0
       31:1    R      reserved10_31_1                 31'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t SER: 1;
                const uint32_t reserved_0: 31;
            } b;
        } SPI_JDI_SER_TypeDef;


    /* 0x14
       15:0    R/W    SCKDV                           16'b0
       31:16   R      reserved14_31_16                16'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t SCKDV: 16;
                const uint32_t reserved_0: 16;
            } b;
        } SPI_JDI_BAUDR_TypeDef;


    /* 0x18
       4:0     R/W    TFT                             5'b0
       31:5    R      reserved18_31_5                 27'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t TFT: 5;
                const uint32_t reserved_0: 27;
            } b;
        } SPI_JDI_TXFTLR_TypeDef;


    /* 0x1C
       5:0     R/W    RFT                             5'b0
       31:5    R      reserved1c_31_5                 27'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t RFT: 6;
                const uint32_t reserved_0: 26;
            } b;
        } SPI_JDI_RXFTLR_TypeDef;


    /* 0x20
       5:0     R      TXTFL                           6'b0
       31:6    R      reserved20_31_6                 26'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t TXTFL: 6;
                const uint32_t reserved_0: 26;
            } b;
        } SPI_JDI_TXFLR_TypeDef;


    /* 0x24
       6:0     R      RXTFL                           6'b0
       31:6    R      reserved24_31_6                 26'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t RXTFL: 7;
                const uint32_t reserved_0: 25;
            } b;
        } SPI_JDI_RXFLR_TypeDef;


    /* 0x28
       0       R      BUSY                            1'b0
       1       R      TFNF                            1'b1
       2       R      TFE                             1'b1
       3       R      RFNE                            1'b0
       4       R      RFF                             1'b0
       5       R      reserved28_5                    1'b0
       6       R      DCOL                            1'b0
       31:7    R      reserved28_31_7                 25'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t BUSY: 1;
                const uint32_t TFNF: 1;
                const uint32_t TFE: 1;
                const uint32_t RFNE: 1;
                const uint32_t RFF: 1;
                const uint32_t reserved_1: 1;
                const uint32_t DCOL: 1;
                const uint32_t reserved_0: 25;
            } b;
        } SPI_JDI_SR_TypeDef;


    /* 0x2C
       0       R/W    TXEIM                           1'b1
       1       R/W    TXOIM                           1'b1
       2       R/W    RXUIM                           1'b1
       3       R/W    RXOIM                           1'b1
       4       R/W    RXFIM                           1'b1
       31:5    R      reserved2c_31_5                 27'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t TXEIM: 1;
                uint32_t TXOIM: 1;
                uint32_t RXUIM: 1;
                uint32_t RXOIM: 1;
                uint32_t RXFIM: 1;
                const uint32_t reserved_0: 27;
            } b;
        } SPI_JDI_IMR_TypeDef;


    /* 0x30
       0       R      TXEIS                           1'b0
       1       R      TXOIS                           1'b0
       2       R      RXUIS                           1'b0
       3       R      RXOIS                           1'b0
       4       R      RXFIS                           1'b0
       31:5    R      reserved30_31_5                 27'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t TXEIS: 1;
                const uint32_t TXOIS: 1;
                const uint32_t RXUIS: 1;
                const uint32_t RXOIS: 1;
                const uint32_t RXFIS: 1;
                const uint32_t reserved_0: 27;
            } b;
        } SPI_JDI_ISR_TypeDef;


    /* 0x34
       0       R      TXEIR                           1'b0
       1       R      TXOIR                           1'b0
       2       R      RXUIR                           1'b0
       3       R      RXOIR                           1'b0
       4       R      RXFIR                           1'b0
       31:5    R      reserved34_31_6                 27'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t TXEIR: 1;
                const uint32_t TXOIR: 1;
                const uint32_t RXUIR: 1;
                const uint32_t RXOIR: 1;
                const uint32_t RXFIR: 1;
                const uint32_t reserved_0: 27;
            } b;
        } SPI_JDI_RISR_TypeDef;


