wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_spi_master_jdi_def.h
    /* 0x38
       0       R      TXOICR                          1'b0
       31:1    R      reserved38_31_1                 31'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t TXOICR: 1;
                const uint32_t reserved_0: 31;
            } b;
        } SPI_JDI_TXOICR_TypeDef;


    /* 0x3C
       0       R      RXOICR                          1'b0
       31:1    R      reserved3c_31_1                 31'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t RXOICR: 1;
                const uint32_t reserved_0: 31;
            } b;
        } SPI_JDI_RXOICR_TypeDef;


    /* 0x40
       0       R      RXUICR                          1'b0
       31:1    R      reserved40_31_1                 31'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t RXUICR: 1;
                const uint32_t reserved_0: 31;
            } b;
        } SPI_JDI_RXUICR_TypeDef;


    /* 0x48
       0       R      ICR                             1'b0
       31:1    R      reserved48_31_1                 31'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t ICR: 1;
                const uint32_t reserved_0: 31;
            } b;
        } SPI_JDI_ICR_TypeDef;


    /* 0x4C
       0       R/W    RDMAE                           1'b0
       1       R/W    TDMAE                           1'b0
       31:2    R      reserved4c_31_2                 30'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t RDMAE: 1;
                uint32_t TDMAE: 1;
                const uint32_t reserved_0: 30;
            } b;
        } SPI_JDI_DMACR_TypeDef;


    /* 0x50
       4:0     R/W    DMATDL                          5'b0
       31:5    R      reserved50_31_5                 27'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t DMATDL: 5;
                const uint32_t reserved_0: 27;
            } b;
        } SPI_JDI_DMATDLR_TypeDef;


    /* 0x54
       4:0     R/W    DMARDL                          5'b0
       31:5    R      reserved54_31_5                 27'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t DMARDL: 5;
                const uint32_t reserved_0: 27;
            } b;
        } SPI_JDI_DMARDLR_TypeDef;


    /* 0x60
       31:0    R/W    DR                              32'b0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t DR: 32;
            } b;
        } SPI_JDI_DR_TypeDef;


    /* 0xF0
       7:0     R/W    RSD                             8'b0
       31:8    R      reservedf0_31_8                 24'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t RSD: 8;
                const uint32_t reserved_0: 24;
            } b;
        } SPI_JDI_RSDR_TypeDef;


    /* 0x200
       0       R/W    wrap_ctrl_mode                  1'b0
       1       R/WAC  mst_tx_fifo_en                  1'b0
       2       R/W    tx_fifo_rst                     1'b0
       3       R/W    mosi_pull_en                    1'b0
       4       R/W    mosi_drv_low_en                 1'b0
       5       R/W    cs_inv_en                       1'b0
       6       R/W    Reserved200_6                   1'b0
       15:7    R      reserved200_15_7                9'b0
       31:16   R/W    mst_tx_ndf                      16'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t wrap_ctrl_mode: 1;
                uint32_t mst_tx_fifo_en: 1;
                uint32_t tx_fifo_rst: 1;
                uint32_t mosi_pull_en: 1;
                uint32_t mosi_drv_low_en: 1;
                uint32_t cs_inv_en: 1;
                uint32_t reserved_1: 1;
                const uint32_t reserved_0: 9;
                uint32_t mst_tx_ndf: 16;
            } b;
        } SPI_WRAP_CTRL_TypeDef;


    /* 0x204
       5:0     R/W    tx_fifo_tl                      6'b0
       31:6    R      reserved204_31_6                26'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t tx_fifo_tl: 6;
                const uint32_t reserved_0: 26;
            } b;
        } SPI_WRAP_TXFTLR_TypeDef;


    /* 0x208
       5:0     R      tx_fifo_lv                      6'b0
       31:6    R      reserved208_31_6                26'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t tx_fifo_lv: 6;
                const uint32_t reserved_0: 26;
            } b;
        } SPI_JDI_MST_TXFLR_TypeDef;


    /* 0x20C
       0       R      cs_en                           1'b0
       1       R      tx_fifo_not_full                1'b1
       2       R      tx_fifo_empty                   1'b1
       31:3    R      reserved20c_31_3                29'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t cs_en: 1;
                const uint32_t tx_fifo_not_full: 1;
                const uint32_t tx_fifo_empty: 1;
                const uint32_t reserved_0: 29;
            } b;
        } SPI_WRAP_SR_TypeDef;


    /* 0x210
       0       R/W    tx_fifo_empty_int_m             1'b0
       1       R/W    tx_fifo_ov_int_m                1'b0
       2       R/W    tx_ndf_done_int_m               1'b0
       31:3    R      reserved210_31_3                29'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t tx_fifo_empty_int_m: 1;
                uint32_t tx_fifo_ov_int_m: 1;
                uint32_t tx_ndf_done_int_m: 1;
                const uint32_t reserved_0: 29;
            } b;
        } SPI_WRAP_IMR_TypeDef;


    /* 0x214
       0       R      tx_fifo_empty_int_st            1'b0
       1       R      tx_fifo_ov_int_st               1'b0
       2       R      tx_ndf_done_int_st              1'b0
       31:3    R      reserved214_31_3                29'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t tx_fifo_empty_int_st: 1;
                const uint32_t tx_fifo_ov_int_st: 1;
                const uint32_t tx_ndf_done_int_st: 1;
                const uint32_t reserved_0: 29;
            } b;
        } SPI_WRAP_ISR_TypeDef;


