wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_spi_master_jdi_def.h
    /* 0x218
       0       R      tx_fifo_empty_r_st              1'b0
       1       R      tx_fifo_ov_r_st                 1'b0
       2       R      tx_ndf_done_r_st                1'b0
       31:3    R      reserved218_31_3                29'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t tx_fifo_empty_r_st: 1;
                const uint32_t tx_fifo_ov_r_st: 1;
                const uint32_t tx_ndf_done_r_st: 1;
                const uint32_t reserved_0: 29;
            } b;
        } SPI_WRAP_RISR_TypeDef;


    /* 0x21C
       0       R      int_clr                         1'b0
       31:1    R      reserved21c_31_1                31'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t int_clr: 1;
                const uint32_t reserved_0: 31;
            } b;
        } SPI_WRAP_ICR_TypeDef;


    /* 0x220
       0       R/W    tx_dma_en                       1'b0
       31:1    R      reserved220_31_1                31'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t tx_dma_en: 1;
                const uint32_t reserved_0: 31;
            } b;
        } SPI_WRAP_DMACR_TypeDef;


    /* 0x224
       5:0     R/W    dma_tx_dl                       6'b0
       31:6    R      reserved224_31_6                26'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t dma_tx_dl: 6;
                const uint32_t reserved_0: 26;
            } b;
        } SPI_WRAP_DMATDLR_TypeDef;


    /* 0x228
       16:0    R      tx_ndf_cnt                      17'b0
       31:17   R      reserved228_31_17               15'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t tx_ndf_cnt: 17;
                const uint32_t reserved_0: 15;
            } b;
        } SPI_WRAP_TXNDF_CNT_TypeDef;


    /* 0x22C
       3:0     R/W    cs_setup_dly                    4'b0
       7:4     R      reserved22c_7_4                 4'b0
       11:8    R/W    cs_hold_dly                     4'b0
       15:12   R      reserved22c_15_12               4'b0
       23:16   R/W    cs_clk_div_sel                  8'b0
       31:24   R      reserved22c_31_24               8'b0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t cs_setup_dly: 4;
                const uint32_t reserved_2: 4;
                uint32_t cs_hold_dly: 4;
                const uint32_t reserved_1: 4;
                uint32_t cs_clk_div_sel: 8;
                const uint32_t reserved_0: 8;
            } b;
        } SPI_WRAP_CS_DLY_TypeDef;


    /* 0x400
       0       R/WAC  rt_jdi_mip_start                1'h0
       31:1    R      reserved_0                      31'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t rt_jdi_mip_start: 1;
                const uint32_t reserved_0: 31;
            } b;
        } CTL0_TypeDef;


    /* 0x404
       0       W1C    output_counter_clear            1'h0
       1       W1C    output_line_counter_clear       1'h0
       2       W1C    tx_fifo_clear                   1'h0
       3       W1C    rx_fifo_clear                   1'h0
       5:4     R/W    output_format                   2'h1
       6       R/W    dummy_bit_for_4bit              1'h0
       8:7     R/W    input_format                    2'h0
       9       R/W    ext_tx_fifo_en                  1'h0
       31:10   R      reserved_0                      23'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t output_counter_clear: 1;
                uint32_t output_line_counter_clear: 1;
                uint32_t tx_fifo_clear: 1;
                uint32_t rx_fifo_clear: 1;
                uint32_t output_format: 2;
                uint32_t dummy_bit_for_4bit: 1;
                uint32_t input_format: 2;
                uint32_t ext_tx_fifo_en: 1;
                const uint32_t reserved_0: 22;
            } b;
        } CTL1_TypeDef;


    /* 0x408
       5:0     R/W    mode_select                     6'h0
       31:6    R      reserved_0                      26'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t mode_select: 6;
                const uint32_t reserved_0: 26;
            } b;
        } MODE_SEL_TypeDef;


    /* 0x40C
       15:0    R/W    data_transfer_dummy_end         16'h0
       21:16   R/W    data_transfer_dummy_mid         6'h0
       31:22   R      reserved_0                      10'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t data_transfer_dummy_end: 16;
                uint32_t data_transfer_dummy_mid: 6;
                const uint32_t reserved_0: 10;
            } b;
        } DATA_TRANSFER_DUMMY_TypeDef;


    /* 0x410
       11:0    R/W    jdi_mip_lcd_width               12'h0
       31:12   R      reserved_0                      20'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t jdi_mip_lcd_width: 12;
                const uint32_t reserved_0: 20;
            } b;
        } DATA_WRITTEN_HORIZONTAL_TypeDef;


    /* 0x414
       9:0     R/W    refresh_start_line_addr         10'h0
       15:10   R      reserved_0                      6'h0
       25:16   R/W    refresh_line_num                10'h0
       27:26   R      reserved_1                      2'h0
       30:28   R/W    refresh_line_addr_incr_num      3'h0
       31      R/W    refresh_line_addr_incr          1'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t refresh_start_line_addr: 10;
                const uint32_t reserved_1: 6;
                uint32_t refresh_line_num: 10;
                const uint32_t reserved_0: 2;
                uint32_t refresh_line_addr_incr_num: 3;
                uint32_t refresh_line_addr_incr: 1;
            } b;
        } DATA_WRITTEN_VERTICAL_TypeDef;


    /* 0x418
       31:0    R      output_counter                  32'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t output_counter: 32;
            } b;
        } OUTPUT_COUNTER_TypeDef;


    /* 0x41C
       9:0     R      output_line_counter             10'h0
       31:10   R      reserved_0                      22'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t output_line_counter: 10;
                const uint32_t reserved_0: 22;
            } b;
        } OUTPUT_LINE_COUNTER_TypeDef;


    /* 0x420
       7:0     R/W    rx_fifo_data                    8'h0
       31:8    R      reserved_0                      24'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t rx_fifo_data: 8;
                const uint32_t reserved_0: 24;
            } b;
        } RX_FIFO_TypeDef;


    /* 0x424
       7:0     R/W    tx_fifo_data                    8'h0
       31:8    R      reserved_0                      24'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t tx_fifo_data: 8;
                const uint32_t reserved_0: 24;
            } b;
        } TX_FIFO_TypeDef;


    /* 0x428
       7:0     R      rx_fifo_offset                  8'h0
       31:8    R      reserved_0                      24'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t rx_fifo_offset: 8;
                const uint32_t reserved_0: 24;
            } b;
        } RX_FIFO_OFFSET_TypeDef;


    /* 0x42C
       7:0     R      tx_fifo_offset                  8'h0
       31:8    R      reserved_0                      24'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t tx_fifo_offset: 8;
                const uint32_t reserved_0: 24;
            } b;
        } TX_FIFO_OFFSET_TypeDef;


    /* 0x430
       7:0     R/W    rx_fifo_dma_threshold           8'h0
       30:8    R      reserved_0                      23'h0
       31      R/W    rx_dma_enable                   1'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t rx_fifo_dma_threshold: 8;
                const uint32_t reserved_0: 23;
                uint32_t rx_dma_enable: 1;
            } b;
        } RX_FIFO_DMA_THRESHOLD_TypeDef;


    /* 0x434
       7:0     R/W    tx_fifo_dma_threshold           8'h0
       30:8    R      reserved_0                      23'h0
       31      R/W    tx_dma_enable                   1'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t tx_fifo_dma_threshold: 8;
                const uint32_t reserved_0: 23;
                uint32_t tx_dma_enable: 1;
            } b;
        } TX_FIFO_DMA_THRESHOLD_TypeDef;


