wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl876x_spi_master_jdi_def.h
    /* 0x438
       7:0     R/W    rx_fifo_int_threshold           8'h0
       31:8    R      reserved_0                      24'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t rx_fifo_int_threshold: 8;
                const uint32_t reserved_0: 24;
            } b;
        } RX_FIFO_INT_THRESHOLD_TypeDef;


    /* 0x43C
       7:0     R/W    tx_fifo_int_threshold           8'h0
       31:8    R      reserved_0                      24'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t tx_fifo_int_threshold: 8;
                const uint32_t reserved_0: 24;
            } b;
        } TX_FIFO_INT_THRESHOLD_TypeDef;


    /* 0x440
       0       R/W    tx_fifo_underflow_int_en        1'h0
       1       R/W    tx_fifo_threshold_int_en        1'h0
       2       R/W    rx_fifo_overflow_int_en         1'h0
       3       R/W    rx_fifo_threshold_int_en        1'h0
       4       R/W    output_finish_int_en            1'h0
       31:5    R      reserved_0                      27'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t tx_fifo_underflow_int_en: 1;
                uint32_t tx_fifo_threshold_int_en: 1;
                uint32_t rx_fifo_overflow_int_en: 1;
                uint32_t rx_fifo_threshold_int_en: 1;
                uint32_t output_finish_int_en: 1;
                const uint32_t reserved_0: 27;
            } b;
        } INT_ENABLE_TypeDef;


    /* 0x444
       0       R/W    tx_fifo_underflow_int_msk       1'h1
       1       R/W    tx_fifo_threshold_int_msk       1'h1
       2       R/W    rx_fifo_overflow_int_msk        1'h1
       3       R/W    rx_fifo_threshold_int_msk       1'h1
       4       R/W    output_finish_int_msk           1'h1
       31:5    R      reserved_0                      27'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t tx_fifo_underflow_int_msk: 1;
                uint32_t tx_fifo_threshold_int_msk: 1;
                uint32_t rx_fifo_overflow_int_msk: 1;
                uint32_t rx_fifo_threshold_int_msk: 1;
                uint32_t output_finish_int_msk: 1;
                const uint32_t reserved_0: 27;
            } b;
        } INT_MASK_TypeDef;


    /* 0x448
       0       R      tx_fifo_underflow_int_raw_status1'h0
       1       R      tx_fifo_threshold_int_raw_status1'h0
       2       R      rx_fifo_overflow_int_raw_status 1'h0
       3       R      rx_fifo_threshold_int_raw_status1'h0
       4       R      output_finish_int_raw_status    1'h0
       31:5    R      reserved_0                      27'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t tx_fifo_underflow_int_raw_status: 1;
                const uint32_t tx_fifo_threshold_int_raw_status: 1;
                const uint32_t rx_fifo_overflow_int_raw_status: 1;
                const uint32_t rx_fifo_threshold_int_raw_status: 1;
                const uint32_t output_finish_int_raw_status: 1;
                const uint32_t reserved_0: 27;
            } b;
        } INT_RAW_STATUS_TypeDef;


    /* 0x44C
       0       R      tx_fifo_underflow_int_status    1'h0
       1       R      tx_fifo_threshold_int_status    1'h0
       2       R      rx_fifo_overflow_int_status     1'h0
       3       R      rx_fifo_threshold_int_status    1'h0
       4       R      output_finish_int_status        1'h0
       31:5    R      reserved_0                      27'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                const uint32_t tx_fifo_underflow_int_status: 1;
                const uint32_t tx_fifo_threshold_int_status: 1;
                const uint32_t rx_fifo_overflow_int_status: 1;
                const uint32_t rx_fifo_threshold_int_status: 1;
                const uint32_t output_finish_int_status: 1;
                const uint32_t reserved_0: 27;
            } b;
        } INT_STATUS_TypeDef;


    /* 0x450
       0       W1C    tx_fifo_underflow_int_clr       1'h0
       1       W1C    tx_fifo_threshold_int_clr       1'h0
       2       W1C    rx_fifo_overflow_int_clr        1'h0
       3       W1C    rx_fifo_threshold_int_clr       1'h0
       4       W1C    output_finish_int_clr           1'h0
       31:5    R      reserved_0                      27'h0
    */
    typedef union
        {
            uint32_t d32;
            struct
            {
                uint32_t tx_fifo_underflow_int_clr: 1;
                uint32_t tx_fifo_threshold_int_clr: 1;
                uint32_t rx_fifo_overflow_int_clr: 1;
                uint32_t rx_fifo_threshold_int_clr: 1;
                uint32_t output_finish_int_clr: 1;
                const uint32_t reserved_0: 27;
            } b;
        } INT_CLEAR_TypeDef;

#ifdef  __cplusplus
}
#endif /* __cplusplus */

#endif /* RTL876X_SPI_Master_JDI_DEF_H */

    /******************* (C) COPYRIGHT 2024 Realtek Semiconductor Corporation *****END OF FILE****/